---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Normal
source: html/b6fb8d33-a9b6-7c84-fb97-af35e3561fdf.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.Normal Property

The local Z direction of the element section in the start point of the curve.

## Syntax (C#)
```csharp
public XYZ Normal { get; }
```